app/controllers/posts_controller.rb

	def new
		@post = Post.new
    @post.title = "Title Goes Here"
    @post.description = "Desc goes here..."
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title Goes Here"], ["description", "Desc goes here..."], ["created_at", "2016-07-06 01:21:52.330361"], ["updated_at", "2016-07-06 01:21:52.330361"]]